package com.example.pizzarecipes;

public class Utils {
    public static final String PIZZA_1_TITLE = "Пицца пепперони";
    public static final String PIZZA_1_DESCRIPTION = "Приготовьте пиццу для всей семьи, каждый кусочек получившейся пиццы будет напоминать о Италии, только попробуйте пепперони, 4сыра и маргарита";
    public static final String PIZZA_1_RECIPE = "ШАГ 1\n" +
            "В теплой воде, нагретой до 37-40°С растворите сахар. А затем всыпьте дрожжи и оставьте на 15 минут до появления пышной шапочки. Если шапочки так и не появилось, то либо дрожжи испорчены, либо перегрели воду и тесто не поднимется. Нужно замешивать заново.\n" +
            "\n" +
            "ШАГ 2\n" +
            "В миску просейте муку. Всыпьте соль. Перемешайте все и сделайте в центре муки углубление.\n" +
            "\n" +
            "ШАГ 3\n" +
            "Замесите упругое однородное тесто. Замешивать нужно около 7-10 минут, пока тесто не начнет отлипать от рук. При необходимости можно добавить ещё немного оливкового масла. Накройте миску полотенцем и оставьте тесто на 45 минут в тепле для подъема.\n" +
            "\n" +
            "ШАГ 4\n" +
            "В чаше блендера соедините помидоры, кетчуп, дольки чеснока, прованские травы и специи. Взбейте все до однородности. В сковороде на среднем огне разогрейте растительное масло. Вылейте взбитую томатную смесь, добавьте томатную пасту. Перемешайте и тушите, помешивая, около 5 минут до испарения жидкости и густоты.\n" +
            "\n" +
            "ШАГ 5\n" +
            "Тесто обомните и раскатайте в тонкую круглую лепешку диаметром около 30 см. Обильно смажьте тесто пряным томатным соусом. Сверху посыпьте тертым сыром. Поверх равномерно распределите кружочки пепперони. Выпекайте пиццу в разогретой до 250°С духовке 8-10 минут. Точное время зависит от вашей духовки. Если есть возможность включить режим \"верх+низ+конвекция\", используйте его. Приятного аппетита!";

}
