package com.example.pizzarecipes;

public class Utils {
    public static final String PIZZA_1_TITLE = "Пицца с домашним соусом";
    public static final String PIZZA_1_DESCRIPTION = "Приготовьте пиццу для всей семьи с домашней основой и томатным соусом. Вегетарианский рецепт идеально подходит для того, чтобы приобщить к приготовлению детей. Сверху посыпьте моцареллой и свежим базиликом";
    public static final String PIZZA_1_RECIPE = "ШАГ 1\n" +
            "Высыпьте муку в миску, затем добавьте дрожжи и 1 ч. л. соли. Сделайте углубление в центре и влейте 200 мл теплой воды (убедитесь, что она не слишком горячая) вместе с маслом. Перемешивайте деревянной ложкой, пока не получится мягкое, достаточно влажное тесто.\n" +
            "\n" +
            "ШАГ 2\n" +
            "Выложите тесто на слегка посыпанную мукой поверхность и месите в течение 5 минут до получения однородной массы. Накройте кухонным полотенцем и отставьте примерно на час или пока тесто не вздуется и не увеличится в размере вдвое. Вы также можете оставить грубое тесто без замешивания в миске, накрыть кухонным полотенцем и оставить в холодильнике на ночь, тогда тесто будет готовиться само по себе.\n" +
            "\n" +
            "ШАГ 3\n" +
            "Тем временем приготовьте томатный соус. Налейте масло в небольшую сковороду и слегка обжарьте чеснок (не дайте ему подрумяниться), затем добавьте пассату и тушите все, пока соус немного не загустеет. Оставьте остывать.\n" +
            "\n" +
            "ШАГ 4\n" +
            "Как только тесто поднимется, быстро замесите его в миске, чтобы отбить, затем выложите на слегка посыпанную мукой поверхность и разделайте на два шарика. Раскатайте каждый шарик в большую каплю, очень тонкую, около 25 см в поперечнике (каплевидные формы легче подходят для выпечки, чем круглые).\n" +
            "\n" +
            "ШАГ 5\n" +
            "Разогрейте духовку до 240 ° C / вентилятор 220 ° C / газ 9 с большим противнем внутри. Переложите одну из основ на другой противень, посыпанный мукой. Разровняйте соус по основе тыльной стороной ложки, распределите по половинке моцареллы, сбрызните оливковым маслом и приправьте. Положите пиццу, все еще лежащую на противне, поверх горячего листа в духовке и запекайте в течение 8-10 минут до образования хрустящей корочки.";

    public static final String PIZZA_2_TITLE = "пицца Маргарита";
    public static final String PIZZA_2_DESCRIPTION = "Гармоничное сочетание теста, сыра, томатов и базилика! Выпекается классическая Пицца Маргарита в домашних условиях в хорошо разогретой духовке очень быстро. Её тонкая основа получается хрустящей, а моцарелла остается нежной. Помидоры успевают запечься, но сохраняют форму.";
    public static final String PIZZA_2_RECIPE = "ШАГ 1\n" +
            "Начните приготовление пиццы с теста. Нагрейте воду до температуры 37-40 градусов. Растворите в ней сахар и добавьте дрожжи. Если нет кулинарного термометра температуру определите следующим способом: капните на внутреннюю сторону запястья каплю воды. Если ощущение нейтральное - значит температура правильная. Оставьте в теплом месте на 5-15 минут для активации дрожжей.\n" +
            "\n" +
            "ШАГ 2\n" +
            "Свойства муки одного сорта, но разных производителей могут отличаться. Поэтому чтобы получить нужную консистенцию, муку добавляйте небольшими порциями. Когда станет затруднительно вымешивать ложкой, начните это делать руками. Тщательно вымесите тесто.\n" +
            "\n" +
            "ШАГ 3\n" +
            "Разомните тесто руками в круглый пласт толщиной 3-5 мм. Края оставьте потолще, чтобы образовался бортик. Равномерно смажьте тесто соусом. Сверху распределите моцареллу. Далее разложите помидоры. Выпекайте 10-15 минут на средней полке предварительно разогретой до 220 градусов духовки при режиме \"верх-низ\". Точное время и температуру определяйте по своей духовке. В готовой пицце края теста слегка зарумянятся. У идеальной пиццы Маргариты кусочки Моцареллы должны лишь слегка подплавиться. Я немного передержала ее в духовке и у меня все растеклось. В следующий раз сделаю температуру побольше.";

    public static final String PIZZA_3_TITLE = "Пицца 4сыра";
    public static final String PIZZA_3_DESCRIPTION = "Пицца \"Четыре сыра\" (итал. pizza ai quattro formaggi) - это так называемая белая пицца, так как в нее не кладут помидоры или томатный соус. ";
    public static final String PIZZA_3_RECIPE = "ШАГ 1\n" +
            "\n" +
            "Воду подогрейте до температуры не выше 40 градусов и влейте в миску.\n" +
            "Всыпьте сахар и дрожжи. Перемешайте и оставьте на 2-3 минуты до растворения.\n" +
            "\n" +
            "ШАГ 2\n" +
            "Подкатанное в шар тесто поместите в миску, накройте полотенцем или плёнкой и оставьте на 40-50 минут в тепле.\n" +
            "\n" +
            "STEP 3\n" +
            "Knead the dough, releasing all the air.\n" +
            "Using a rolling pin, roll out the dough into a thin round layer about 35-40 cm in diameter (for those who are comfortable, do it immediately on parchment).\n" +
            "\n" +
            "STEP 4\n" +
            "Transfer the cake to an inverted baking sheet lined with parchment (so the finished pizza will easily slide off it onto a wooden plank).\n" +
            "\n" +
            "ШАГ 5\n" +
            "Рикотту разложите ложкой по всей поверхности коржа, оставляя незаполненными 1,5-2 см по краю. \n" +
            "Горгонзолу разломайте на небольшие кусочки и выложите на слой рикотты. Сверху посыпьте тёртым пармезаном.\n" +
            "\n" +
            "ШАГ 6\n" +
            "\n" +
            "Подошедшую пиццу отправьте в разогретую духовку и выпекайте 5-6 минут, до готовности. Сыр должен полностью расплавиться, а края пиццы превратиться в бортики, стать румяными и твёрдыми.";

}
